/*＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
K.R c

字符串操作函数
atoi函数：将字符串s转换为相应的整型数

如把字符串“123”转换成整数123。
n初始化为0
当i为0时，s[i]='1'，n=0*10+'1'-'0'=1。
当i为1时，s[i]='2'，n=1*10+'2'-'0'=12。
当i为3时，s[i]='3'，n=12*10+'3'-'0'=123。
＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊*/

#include <stdio.h>

int atoi(char s[]); //将字符串s转换为相应的整型数

int main()
{
  char temp[10];
  int i;
  char c;

  i = 0;
  while ((c = getchar()) != EOF) {
    temp[i] = c;
    ++i;
  }
  printf("%d\n",atoi(temp));
}

int atoi(char s[])
{
  int i,n;

  n = 0;  //n控制个十百千
  for(i = 0; s[i] >= '0' && s[i] <= '9';++i)
      n = n * 10 + (s[i] - '0');      //将字符转换为数字
  return n;
}
