/*＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊
K.R c
版本 

练习2-3 编写函数htoi(s)，把由十六进制数字组成的字符串（包含可选的前缀0x或0X）
转换为与之等价的整型值。字符串中允许包含的数字包括：0～9、a~f以及A~F。

例如：
字符串 “abc123456789ABC”
转换为  abc123456789ABC
＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊*/

#include <stdio.h>
#define MAX 100 
int main()
{
    char c;
    char s[MAX];
    int i;
    while ((c != getchar()) != EOF) {
        if(c >= '0' && c <= '9')
        {
          
        }
        if(c >= 'a' && c <= 'f')
        {}
        if(c >= 'A' && c <= 'F')
        {}  
    }
    i = 0;
    while (s[i] != '\0') {
      putchar(s[i]);
    }
}
