/**********************************
 题目描述：
  *    
 ***
*****
 ***
  *


首先需要输出前三行
第一行先二个空格，一颗心；
第二行先一个空格，三颗心；
第三行先零个空格，五颗心；

输入后两行
第一行先一个空格，三颗星；
第二行先两个空格，一颗星；
*************************************/

/*******************************************
描述：这是一个打印钻石菱形程序
功能：实现打印星号功能
版本：v1.00
作者：汤俊伟
时间：2017.05.20
学习点：for循环嵌套
********************************************/

#include <stdio.h>

int main(){
    int i,j;

    for(i=1;i < 4;i++)
    {
        for(j=1;j < 4-i;j++)
            printf(" ");
        for(j=1;j <= 2 * i -1;j++)
            printf("*");
        printf("\n");
    }
    for(i = 1;i < 3; i++)
    {
        for(j = 0;j < i; j++)
            printf(" ");
        for(j = 1; j <= 5 - 2 * i; j++)
            printf("*");
        printf("\n");
    }

}
